Tekla.Structures.Drawing.StraightDimensionSet
The StraightDimensionSet class defines a straight dimension set.

Tekla.Structures.Drawing.StraightDimensionSet.Attributes
The straight dimension set attributes.

Tekla.Structures.Drawing.StraightDimensionSet.DimensionPoints
The list of the dimension points.

Tekla.Structures.Drawing.StraightDimensionSet.Distance
The distance from the first dimension point to the dimension line.
The distance is measured in paper millimeters.

Tekla.Structures.Drawing.StraightDimensionSet.UpDirection
The direction from the dimension points to the dimension line.

Tekla.Structures.Drawing.StraightDimensionSet.LeftTagLineOffset
The offset of the left tag line.
The offset is measured in paper millimeters.

Tekla.Structures.Drawing.StraightDimensionSet.RightTagLineOffset
The offset of the right tag line.
The offset is measured in paper millimeters.

Tekla.Structures.Drawing.StraightDimensionSet.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.StraightDimensionSet.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
OperationType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.StraightDimensionSet.GetAllExcludePartsAccordingToFilter
Retrieves all the possible valid filters for ExcludePartsAccordingToFilter.
Returns: A list of string that correspond to the filters available.

Tekla.Structures.Drawing.StraightDimensionSet.Select
Selects the straight dimension set from the database.
Returns: True if the selection succeeds.

Tekla.Structures.Drawing.StraightDimensionSet.Insert
Dimension sets cannot be inserted into the database.
Returns: A System.NotImplementedException.

Tekla.Structures.Drawing.StraightDimensionSet.InternalInsert
Dimension sets can only be Inserted Internally.
Returns: True if Insert succeeds.

Tekla.Structures.Drawing.StraightDimensionSet.Delete
Deletes the dimension set and its child dimensions from the database.
Returns: True if the deletion succeeds.

Tekla.Structures.Drawing.StraightDimensionSet.Modify
Modifies the existing dimension set in the database.
Returns: True if the updating succeeds.